[{"word":"ABERRATION","published":"2023-05-25","generated":"2023-05-27","path":"/wotdarchive/wotd2023-05-25-ABERRATION.html","ai":"gpt35turbo","content":"\n\n  \n    <!-- Title -->\n    <h1>The Word of The Day is ABERRATION &#x1F47D</h1>\n\n    <!-- Definition -->\n    <p><u>Aberration</u>: a departure from what is normal, usual, or expected, typically one that is unwelcome.</p>\n\n    <!-- Etymology summary -->\n    <p>Derived from the Latin word \"aberratio\", meaning a wandering or straying away from. The word was first recorded in the mid 16th century.</p>\n\n    <!-- Example Sentences -->\n    <h2>Example Sentences</h2>\n    <ul>\n      <li>Her decision to drop out of college was an aberration; she had always been an excellent student.</li>\n      <li>The sudden rush of customers was an aberration; the store was usually empty.</li>\n      <li>His behavior at the party was an aberration; normally he was reserved and polite.</li>\n    </ul>\n\n    <!-- Practice Tasks -->\n    <h2>Practice Tasks</h2>\n    <ol>\n      <li>Write a sentence that uses <u>aberration</u> to describe a sudden change in the weather.</li>\n      <li>Create a dialogue using <u>aberration</u> to describe a mistake one character made.</li>\n      <li>Write five synonyms for <u>aberration</u> and use them in sentences.</li>\n    </ol>\n\n    <!-- Creative Writing Task -->\n    <h2>Creative Writing Task</h2>\n    <p>Write a short story that includes the word <u>aberration</u>. The story can be about anything you like, as long as it fits the definition of the word.</p>\n\n    <!-- Drawing Task -->\n    <h2>Drawing Task</h2>\n    <p>Draw an image that represents the word <u>aberration</u>. You can use any medium you like, and the image can be abstract or representational.</p>\n\n  \n"},{"word":"ENMITY","published":"2023-05-26","generated":"2023-05-27","path":"/wotdarchive/wotd2023-05-26-ENMITY.html","ai":"gpt35turbo","content":"\n\n  \n    <h1>The Word of The Day is ENMITY &#129312;</h1>\n    <p><u>Enmity</u> means the state or feeling of being actively opposed or hostile to someone or something.</p>\n    <p>Derived from the Middle English word \"enmite,\" from Old French \"enemistie,\" from Latin \"inimicitia,\" from \"inimicus\" meaning \"hostile,\" the word was first used in the 15th century.</p>\n    <p>Example sentences:</p>\n    <ol>\n      <li>There is a lot of enmity between the two rival gangs in the city.</li>\n      <li>She felt intense enmity towards her former employer after being unfairly fired.</li>\n      <li>The enmity between the two nations lasted for decades.</li>\n    </ol>\n    <h2>Practice Tasks:</h2>\n    <ul>\n      <li>Write a sentence using <u>enmity</u> to describe a situation in your school or workplace</li>\n      <li>Create a dialogue between two people who are experiencing enmity towards each other</li>\n      <li>Use <u>enmity</u> in a creative insult directed towards a fictional character or celebrity</li>\n    </ul>\n    <h2>Creative Writing Task:</h2>\n    <p>Write a short story or poem that features the theme of enmity.</p>\n    <h2>Drawing Task:</h2>\n    <p>Create a drawing or illustration that represents the feeling of enmity.</p>\n  \n"},{"word":"MOROSE","published":"2023-05-27","generated":"2023-05-27","path":"/wotdarchive/wotd2023-05-27-MOROSE.html","ai":"gpt35turbo","content":"\n\n  \n    <h1>The Word of The Day is MOROSE &#x1F1F3;&#x1F1F4;</h1>\n    <p><u>Morose</u> (adj.): sullen and ill-tempered </p>\n    <p>Etymology: from the Latin word \"morosus\" which means peevish or fretful </p>\n    <h2>Example Sentences:</h2>\n    <ul>\n      <li>The morose man sat alone at the back of the coffee shop, scowling at everyone who walked by.</li>\n      <li>Her morose attitude made it difficult for her to make friends.</li>\n      <li>After losing his job, he became increasingly morose and withdrawn.</li>\n    </ul>\n    <h2>Practice Tasks:</h2>\n    <ol>\n      <li>Write a sentence using <u>morose</u> to describe how someone might act at a funeral.</li>\n      <li>Create a dialogue between two people, one who is morose and one who is trying to cheer them up.</li>\n      <li>Write a short paragraph about a character who has a morose personality, and how it affects their relationships with others.</li>\n    </ol>\n    <h2>Creative Writing Task:</h2>\n    <p>Write a short story with a morose character who experiences a sudden change in mood and attitude. </p>\n    <h2>Drawing Task:</h2>\n    <p>Create a drawing or sketch that depicts a morose person in a specific setting or situation.</p>\n  \n"},{"word":"ERUDITE","published":"2023-05-29","generated":"2023-05-27","path":"/wotdarchive/wotd2023-05-29-ERUDITE.html","ai":"gpt35turbo","content":"\n\n  \n    <h1>The Word of The Day is ERUDITE &#x1F4DA;</h1>\n    <p><u>Erudite</u> means having or showing great knowledge or learning.</p>\n    <p>The word <u>erudite</u> comes from the Latin word eruditus, past participle of eruere, which means to “dig out” or “free from.”</p>\n    <h2>Example Sentences</h2>\n    <ul>\n      <li>She was known for her <u>erudite</u> lectures on philosophy and literature.</li>\n      <li>The professor's <u>erudite</u> study on ancient history won him the award for best research paper.</li>\n      <li>The scholar's <u>erudite</u> commentary on the film's cultural significance was widely praised.</li>\n    </ul>\n    <h2>Practice Tasks</h2>\n    <ol>\n      <li>Write a paragraph about an <u>erudite</u> person you know.</li>\n      <li>Create a quiz using the word <u>erudite</u> in three of the questions.</li>\n      <li>Design a crossword puzzle including words like <u>erudite</u>, learned, scholarly, and educated.</li>\n    </ol>\n    <h2>Creative Writing Task</h2>\n    <p>Write a short story that incorporates the word <u>erudite</u> in a creative way. Be sure to use the word in context.</p>\n    <h2>Drawing Task</h2>\n    <p>Create a drawing that captures the essence of the word <u>erudite</u>. Think about incorporating symbols or imagery that represent knowledge or learning.</p>\n  \n"},{"word":"MYRIAD","published":"2023-05-30","generated":"2023-05-27","path":"/wotdarchive/wotd2023-05-30-MYRIAD.html","ai":"gpt35turbo","content":"\n<html lang=\"en\">\n  \n    <h1>The Word of The Day is MYRIAD &#128736;</h1>\n    <p><u>Myriad</u> means a countless or extremely large number of people or things.</p>\n    <p>The word <u>myriad</u> comes from the Greek word \"murias,\" meaning \"ten thousand.\"</p>\n    <h2>Example Sentences</h2>\n    <p>1. The myriad stars twinkled in the night sky.</p>\n    <p>2. She had a myriad of ideas for her new startup.</p>\n    <p>3. The city's myriad problems seem insurmountable.</p>\n    <h2>Practice Tasks</h2>\n    <p>1. Write a sentence using the word <u>myriad</u> to describe a busy street corner.</p>\n    <p>2. List a myriad of ways to reduce your carbon footprint.</p>\n    <p>3. Describe a person who has a myriad of talents.</p>\n    <h2>Creative Writing Task</h2>\n    <p>Write a short story about a character who discovers a myriad of surprises on a trip to a new city.</p>\n    <h2>Drawing Task</h2>\n    <p>Draw a picture of a myriad of animals in a forest.</p>\n  \n"},{"word":"ACQUIESCE","published":"2023-05-31","generated":"2023-05-27","path":"/wotdarchive/wotd2023-05-31-ACQUIESCE.html","ai":"gpt35turbo","content":"\n\n  \n    <h1>The Word of The Day is ACQUIESCE &#x1F64F;</h1>\n    <p><strong>Definition:</strong> To accept, comply, or submit without objection or resistance.</p>\n    <p><strong>Etymology:</strong> The word comes from the Latin word \"acquiescere\" which means \"to find rest in\".</p>\n    <h2>Example Sentences:</h2>\n    <ul>\n      <li>After a long argument, John finally decided to <u>acquiesce</u> to his wife's decision.</li>\n      <li>The professor refused to <u>acquiesce</u> to the student's request for a grade change.</li>\n      <li>She was tired of fighting the system and decided to <u>acquiesce</u> to the rules.</li>\n    </ul>\n    <h2>Practice Tasks:</h2>\n    <ol>\n      <li>Write a sentence using <u>acquiesce</u> in the present tense.</li>\n      <li>Use <u>acquiesce</u> in a sentence with a negative connotation.</li>\n      <li>Create a question using <u>acquiesce</u>.</li>\n    </ol>\n    <h2>Creative Writing Task:</h2>\n    <p>Write a short story where the main character must <u>acquiesce</u> to a difficult situation, and how they deal with it.</p>\n    <h2>Drawing Task:</h2>\n    <p>Draw a scene where someone is <u>acquiescing</u> to someone else's authority or decision.</p>\n  \n"},{"word":"EXTOL","published":"2023-06-01","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-01-EXTOL.html","ai":"gpt35turbo","content":"\n\n  \n    <h1>The Word of The Day is EXTOL &#128077;</h1>\n    <p><u>EXTOL</u>: to praise enthusiastically.</p>\n    <p><u>Etymology:</u> from Latin \"extollere\" meaning \"to elevate\", which later evolved to \"extollere\" meaning \"to praise highly\".</p>\n    <h2>Example Sentences:</h2>\n    <ol>\n      <li>I always <u>extol</u> the virtues of hard work to my children.</li>\n      <li>The coach would always <u>extol</u> his team's efforts after every game.</li>\n      <li>The book was <u>extolled</u> by many critics for its gripping plot and vivid descriptions.</li>\n    </ol>\n    <h2>Practice Tasks:</h2>\n    <ul>\n      <li>Write a short paragraph describing a person or a thing you <u>extol</u>.</li>\n      <li>Give a speech about a topic that you <u>extol</u>.</li>\n      <li>Make a list of five things you can <u>extol</u> about yourself or someone else.</li>\n    </ul>\n    <h2>Creative Writing Task:</h2>\n    <p>Write a short story about a character who discovers the power of <u>extolling</u> the people in their life.</p>\n    <h2>Drawing Task:</h2>\n    <p>Draw a picture that conveys the feeling of <u>extolling</u> someone or something.</p>\n  \n"},{"word":"NADIR","published":"2023-06-02","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-02-NADIR.html","ai":"gpt35turbo","content":"\n\n  \n    <h1>The Word of The Day is NADIR <img src=\"https://emojipedia-us.s3.amazonaws.com/content/2020/06/03/emojipedia-vehicle-boat_1f6a2.png\" alt=\"Boat Emoji\"></h1>\n    <p><u>Nadir</u> is the lowest point of something, typically the point where it reaches rock bottom.</p>\n    <h2>Etymology</h2>\n    <p>The word <u>nadir</u> comes from Arabic nāzir, meaning \"opposite\", and is derived from the phrase \"nadir as-samt\", which means \"opposite to zenith\" or \"opposite to the direction in which the sun appears to move\".</p>\n    <h2>Example Sentences</h2>\n    <ul>\n      <li>After the success of her last movie, her career hit a <u>nadir</u>.</li>\n      <li>The team's performance reached a <u>nadir</u> when they lost to the worst-ranked team.</li>\n      <li>His popularity dipped to a <u>nadir</u> after the scandal.</li>\n    </ul>\n    <h2>Practice Tasks</h2>\n    <ul>\n      <li>Write a sentence using <u>nadir</u> as a verb.</li>\n      <li>Create a question using the word <u>nadir</u>.</li>\n      <li>Write a short paragraph using <u>nadir</u> at least three times.</li>\n    </ul>\n    <h2>Creative Writing Task</h2>\n    <p>Write a story about a character who has hit rock bottom and must find a way to rise above their <u>nadir</u>.</p>\n    <h2>Drawing Task</h2>\n    <p>Create a drawing that represents the concept of <u>nadir</u>.</p>\n  \n"},{"word":"ALACRITY","published":"2023-06-03","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-03-ALACRITY.html","ai":"gpt35turbo","content":"\n\n\n\n\n  <h1>The Word of The Day is ALACRITY &#10024;</h1>\n\n  <p><u>ALACRITY</u> (noun): brisk and cheerful readiness</p>\n\n  <p><u>Etymology:</u> The word derives from the Latin word <i>alacritas</i>, meaning eagerness.</p>\n\n  <h2>Example Sentences:</h2>\n  <ul>\n    <li>He responded to the emergency with alacrity.</li>\n    <li>She showed alacrity in completing the task before the deadline.</li>\n    <li>His alacrity in volunteering for the project ensured its success.</li>\n  </ul>\n\n  <h2>Practice Tasks:</h2>\n  <ol>\n    <li>Write a sentence using <u>alacrity</u> to describe someone's response to a request.</li>\n    <li>Use <u>alacrity</u> in a sentence to describe completing a task efficiently.</li>\n    <li>Write a sentence describing someone who lacks <u>alacrity</u> in their work.</li>\n  </ol>\n\n  <h2>Creative Writing Task:</h2>\n  <p>Write a short story in which the protagonist must use alacrity to overcome an obstacle.</p>\n\n  <h2>Drawing Task:</h2>\n  <p>Draw a picture of a character who embodies alacrity.</p>\n\n\n\n"},{"word":"AMIABLE","published":"2023-06-04","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-04-AMIABLE.html","ai":"gpt35turbo","content":"\n\n\t\n\t\t<h1>The Word of The Day is AMIABLE &#128522;</h1>\n\t\t<p><u>Amiable</u>, an adjective, means having or displaying a friendly and pleasant manner. It can also refer to an agreeable disposition or character.</p>\n\t\t<p>The word \"Amiable\" originated in the 14th century from the Latin word amicabilis meaning friendly, kind, or pleasant.</p>\n\t\t\n\t\t<h2>Example Sentences:</h2>\n\t\t<ol>\n\t\t\t<li><u>Amiable</u> Bob greeted everyone with a smile as he walked into the room.</li>\n\t\t\t<li>The cute, <u>amiable</u> puppy wagged its tail excitedly as it met the children at the park.</li>\n\t\t\t<li>The hostess at the restaurant was always <u>amiable</u> and made sure that her guests felt welcome.</li>\n\t\t</ol>\n\t\t\n\t\t<h2>Practice Tasks:</h2>\n\t\t<ul>\n\t\t\t<li>Write a sentence using <u>amiable</u> to describe someone you admire.</li>\n\t\t\t<li>Use the word <u>amiable</u> in a sentence to describe the weather.</li>\n\t\t\t<li>Unscramble the word EGAILMA and write a sentence using the word once you've figured it out.</li>\n\t\t</ul>\n\t\t\n\t\t<h2>Creative Writing Task:</h2>\n\t\t<p>Write a short story about a character who is known for their <u>amiable</u> nature. What challenges do they face because of this? How do they overcome them?</p>\n\t\t\n\t\t<h2>Drawing Task:</h2>\n\t\t<p>Draw a picture of a person or an animal with an <u>amiable</u> expression on their face. This person/animal should be surrounded by other people/animals who also look happy and friendly.</p>\n\t\n"},{"word":"APPEASE","published":"2023-06-05","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-05-APPEASE.html","ai":"gpt35turbo","content":"\n\n  \n    <h1>The Word of The Day is APPEASE &#128522;</h1>\n    <p><u>Appease</u> means to bring a state of peace or calmness, especially by making concessions or giving into demands.</p>\n    <p>Etymology: From the Old French word 'apaiser', meaning to pacify or soothe.</p>\n    <h2>Example Sentences:</h2>\n    <ol>\n      <li>She tried to <u>appease</u> the crying toddler by offering him a cookie.</li>\n      <li>The government hoped to <u>appease</u> the protesters by making changes to the controversial law.</li>\n      <li>The manager tried to <u>appease</u> the angry customer by offering a refund.</li>\n    </ol>\n    <h2>Practice Tasks:</h2>\n    <ol>\n      <li>Write a sentence using <u>appease</u> to describe how you calm yourself when you are stressed.</li>\n      <li>Use the word <u>appease</u> to suggest how a company might attempt to address customer complaints.</li>\n      <li>Write a sentence using <u>appease</u> to describe a situation where someone tries to placate a panicking animal.</li>\n    </ol>\n    <h2>Creative Writing Task:</h2>\n    <p>Write a short story about a character who must <u>appease</u> a powerful leader to prevent a war from breaking out.</p>\n    <h2>Drawing Task:</h2>\n    <p>Create a drawing that represents the concept of <u>appease</u>.</p>\n  \n"},{"word":"ARCANE","published":"2023-06-06","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-06-ARCANE.html","ai":"gpt35turbo","content":"\n\n\n\n<h1>The Word of The Day is ARCANE &#x1F47D;</h1>\n\n<p><u>Arcane</u>, (adjective) means understood by few; mysterious or secret.</p>\n\n<h2>Etymology</h2>\n<p>The word arcane originates from the Latin word \"arcanus\" meaning secret. It was first used in English in the early 17th century to describe something that was understood by only a select few.</p>\n\n<h2>Example Sentences</h2>\n<ol>\n<li>Her knowledge of computers was so arcane that nobody else could understand it.</li>\n<li>The inner workings of the organization were shrouded in arcane rituals.</li>\n<li>The book contains an arcane language that only a few can comprehend.</li>\n</ol>\n\n<h2>Practice Tasks</h2>\n<ul>\n<li>Write a sentence using the word arcane to describe something you find difficult to understand.</li>\n<li>Use the word arcane in a sentence to describe a book or movie that only a select few would appreciate.</li>\n<li>Create a riddle that includes the word arcane.</li>\n</ul>\n\n<h2>Creative Writing Task</h2>\n<p>Write a short story in which the protagonist discovers an arcane object that changes their life in a significant way.</p>\n\n<h2>Drawing Task</h2>\n<p>Create a drawing of an arcane symbol or object that holds a secret power or meaning.</p>\n\n\n"},{"word":"AVARICE","published":"2023-06-07","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-07-AVARICE.html","ai":"gpt35turbo","content":"\n\n  \n    <h1>The Word of The Day is AVARICE &#128176;</h1>\n    <p><u>Avarice</u>: extreme greed for wealth or material gain.</p>\n    <p><u>Etymology:</u> The word \"avarice\" comes from the Latin word \"avaritia\" meaning \"greed\".</p>\n    <h2>Example Sentences:</h2>\n    <ul>\n      <li>His avarice for money led him down a dark path.</li>\n      <li>Peter's avarice caused him to cheat on the exam.</li>\n      <li>The CEO's avarice put the company's future in jeopardy.</li>\n    </ul>\n    <h2>Practice Tasks:</h2>\n    <ol>\n      <li>Rewrite this sentence using the word \"avarice\": His extreme desire for power corrupts him.</li>\n      <li>Use \"avarice\" in a sentence that describes a character in a story.</li>\n      <li>Create a scenario where someone's avarice leads to negative consequences.</li>\n    </ol>\n    <h2>Creative Writing Task:</h2>\n    <p>Write a short story about a person who overcomes their avarice.</p>\n    <h2>Drawing Task:</h2>\n    <p>Create a drawing that represents the negative effects of avarice.</p>\n  \n"},{"word":"BRAZEN","published":"2023-06-08","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-08-BRAZEN.html","ai":"gpt35turbo","content":"\n\n\n  <center>\n    <h1>The Word of The Day is BRAZEN &#128128;</h1>\n  </center>\n  <br>\n  <p><u>BRAZEN</u>: Bold and without shame.</p>\n  <br>\n  <p><u>Etymology</u>: The word brazen comes from the Old English word bræsen, which means made of brass.</p>\n  <br>\n  <p><u>Example Sentences</u>:</p>\n  <ol>\n    <li>She made a <u>brazen</u> attempt to steal the jewels.</li>\n    <li>The <u>brazen</u> politician was caught taking bribes.</li>\n    <li>He asked for a raise in a <u>brazen</u> manner.</li>\n  </ol>\n  <br>\n  <h2>Practice Tasks:</h2>\n  <ol>\n    <li>Use the word <u>brazen</u> in a sentence to describe a person.</li>\n    <li>Use the word <u>brazen</u> in a sentence to describe an action.</li>\n    <li>Use the word <u>brazen</u> in a sentence to describe a feeling.</li>\n  </ol>\n  <br>\n  <h2>Creative Writing Task:</h2>\n  <p>Write a short story using the word <u>brazen</u> at least five times. Be creative!</p>\n  <br>\n  <h2>Drawing Task:</h2>\n  <p>Create a drawing or illustration that incorporates the word <u>brazen</u>. Be imaginative and have fun!</p>\n\n"},{"word":"BRUSQUE","published":"2023-06-09","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-09-BRUSQUE.html","ai":"gpt35turbo","content":"\n\n\n\n\n  <h1>The Word of the Day is BRUSQUE &#128531;</h1>\n\n  <p><u>BRUSQUE</u> (adjective): abrupt or curt in manner or speech</p>\n\n  <p><u>Etymology:</u> from French <i>brusque</i>, from Italian <i>brusco</i>, meaning rough or tart</p>\n\n  <h2>Example Sentences:</h2>\n\n  <ol>\n    <li>His <u>brusque</u> reply left her feeling hurt.</li>\n    <li>The CEO was known for his <u>brusque</u> attitude and short fuse.</li>\n    <li>She was taken aback by the <u>brusque</u> dismissal of her proposal.</li>\n  </ol>\n\n  <h2>Practice Tasks:</h2>\n\n  <ol>\n    <li>Write a sentence using <u>brusque</u> to describe a character in a book you're reading.</li>\n    <li>Make up a conversation between two coworkers, one of whom is being <u>brusque</u>.</li>\n    <li>Describe a scenario where someone's <u>brusque</u> behavior would be appropriate.</li>\n  </ol>\n\n  <h2>Creative Writing Task:</h2>\n  <p>Write a short story or scene where a <u>brusque</u> character learns a valuable lesson about kindness and empathy.</p>\n\n  <h2>Drawing Task:</h2>\n  <p>Draw a cartoon of a person with a <u>brusque</u> attitude and a person with a kind attitude, facing each other.</p>\n\n\n\n"},{"word":"CAJOLE","published":"2023-06-10","generated":"2023-05-27","path":"/wotdarchive/wotd2023-06-10-CAJOLE.html","ai":"gpt35turbo","content":"\n\n\n\t<h1>The Word of The Day is CAJOLE &#128521;</h1>\n\t<p><u>Cajole</u> - to persuade someone to do something by sustained coaxing or flattery</p>\n\t<p>Etymology - from the French word <i>cajoler</i> meaning \"to cajole, wheedle, coax\"</p>\n\t<h2>Example Sentences:</h2>\n\t<ol>\n\t\t<li>She tried to <u>cajole</u> him into going to the party.</li>\n\t\t<li>The salesman <u>cajoled</u> the customer into buying the more expensive product.</li>\n\t\t<li>He gently <u>cajoled</u> his best friend into donating to his charity.</li>\n\t</ol>\n\t<h2>Practice Tasks:</h2>\n\t<ol>\n\t\t<li>Write a short paragraph explaining how you would <u>cajole</u> someone to do you a favor.</li>\n\t\t<li>Create a dialogue where one character is trying to <u>cajole</u> the other character to go somewhere or do something.</li>\n\t\t<li>Brainstorm three additional scenarios where you might have to <u>cajole</u> someone.</li>\n\t</ol>\n\t<h2>Creative Writing Task:</h2>\n\t<p>Write a short story about a character who is constantly trying to <u>cajole</u> others to do what they want, and how this affects their relationships.</p>\n\t<h2>Drawing Task:</h2>\n\t<p>Draw a cartoon character who is a master at <u>cajoling</u> others.</p>\n\n"},{"word":"ABHOR","published":"2023-05-28","generated":"2023-05-28","path":"/wotdarchive/wotd2023-05-28-ABHOR.html","ai":"gpt35turbo","content":"\n\n\n\n<h1>The Word of The Day is ABHOR &#x1F62D;</h1>\n\n<p><u>Abhor</u>: to regard with disgust or hatred</p>\n\n<p><u>Etymology</u>: from the Latin word <i>abhorrere</i>, meaning \"to shrink from in horror\"</p>\n\n<h2>Example Sentences:</h2>\n\n<ol>\n  <li>She abhors the thought of having to speak in public.</li>\n  <li>The idea of eating sushi abhors him.</li>\n  <li>He abhors the way his ex-girlfriend treated him.</li>\n</ol>\n\n<h2>Practice Tasks:</h2>\n\n<ol>\n  <li>Write a sentence about a time when you abhorred a food.</li>\n  <li>Use the word abhor in a sentence about a person you strongly dislike.</li>\n  <li>Write a sentence about something you abhor doing for school.</li>\n</ol>\n\n<h2>Creative Writing Task:</h2>\n\n<p>You wake up one morning to find that everyone in the world has disappeared except for one person - someone you abhor. Write a story about what happens next.</p>\n\n<h2>Drawing Task:</h2>\n\n<p>Draw a picture of something that you abhor.</p>\n\n\n"},{"word":"CALLOUS","published":"2023-06-11","generated":"2023-05-28","path":"/wotdarchive/wotd2023-06-11-CALLOUS.html","ai":"gpt35turbo","content":"\n\n\n\n  <h1><u>CALLOUS</u> &#x1F916;</h1>\n  <p><u>Definition:</u> showing or having an insensitive and cruel disregard for others</p>\n  <p><u>Etymology:</u> The word 'callous' comes from the Middle English word 'callos', which means 'hardened' or 'toughened'. </p>\n  <h2>Example Sentences:</h2>\n  <p>1. His <u>callous</u> attitude towards the poor was disturbing. </p>\n  <p>2. She couldn't believe how <u>callous</u> her ex-boyfriend was after their break-up. </p>\n  <p>3. The soldier had a <u>callous</u> attitude towards the people he was there to protect. </p>\n  <h2>Practice Tasks:</h2>\n  <p>1. Rewrite each of the three example sentences, replacing the word <u>callous</u> with a synonym.</p>\n  <p>2. Write a short letter to the editor of your local newspaper describing a <u>callous</u> act you witnessed and explaining why it was wrong. </p>\n  <p>3. Create a dialogue between two characters, one of whom demonstrates a <u>callous</u> attitude towards the other. </p>\n  <h2>Creative Writing Task:</h2>\n  <p>Write a short story that includes the word <u>callous</u>. </p>\n  <h2>Drawing Task:</h2>\n  <p>Create a drawing that represents the meaning of the word <u>callous</u>. </p>\n\n\n"}]